python_notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-05-18 Fri 09:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>python notes</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="孙士杰" />
</head>
<body>
<div id="content">
<h1 class="title">python notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge840354">1. 类型</a></li>
<li><a href="#org89e1739">2. 内置核心数据类型</a></li>
<li><a href="#orgd19f41d">3. 数值</a>
<ul>
<li><a href="#orgacb885a">3.1. int</a></li>
<li><a href="#orgb936101">3.2. float</a></li>
<li><a href="#org3d22c53">3.3. 运算符</a></li>
<li><a href="#org796f2b8">3.4. 常用函数</a></li>
<li><a href="#org30fad90">3.5. 工具模块</a></li>
</ul>
</li>
<li><a href="#org5140f2b">4. 序列</a>
<ul>
<li><a href="#org9cfe43a">4.1. 可变序列</a>
<ul>
<li><a href="#org1abeaaa">4.1.1. list</a></li>
<li><a href="#org965dfcf">4.1.2. 通用操作</a></li>
</ul>
</li>
<li><a href="#orgc3a119f">4.2. 不可变序列</a>
<ul>
<li><a href="#org68920e3">4.2.1. tuple</a></li>
<li><a href="#org6d0d986">4.2.2. range</a></li>
<li><a href="#orgb34b97d">4.2.3. 字符串 str</a></li>
</ul>
</li>
<li><a href="#org9af82cc">4.3. 通用操作</a></li>
</ul>
</li>
<li><a href="#orgbbe8042">5. 集合</a></li>
<li><a href="#orgd225ee1">6. 映射</a></li>
<li><a href="#org51f912d">7. 程序单元类型</a></li>
<li><a href="#orgc3a5844">8. 其他</a>
<ul>
<li><a href="#orgf195ba9">8.1. 类型对象</a></li>
<li><a href="#org2972954">8.2. 空对象</a></li>
<li><a href="#orgfb86fcf">8.3. 布尔</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="orge840354" class="outline-2">
<h2 id="orge840354"><span class="section-number-2">1</span> 类型</h2>
<div class="outline-text-2" id="text-1">
<p>
动态类型  强类型变量无类型约束对象本身带有类型描述和引用计数器共享引用,多个变量引用同一个对象
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2;">x</span> = <span style="color: #2aa198;">"tom"</span>
<span style="color: #268bd2;">y</span> = <span style="color: #2aa198;">"tom"</span>
<span style="color: #839496; font-weight: bold;">id</span>(x)
<span style="color: #839496; font-weight: bold;">id</span>(y)

a <span style="color: #859900; font-weight: bold;">is</span> b  //&#21028;&#26029;&#26159;&#21542;&#26159;&#21516;&#19968;&#20010;&#23545;&#35937;
</pre>
</div>

<p>
0 - 255 的值都已经缓存起来了小型的字符串也缓存起来了
</p>
</div>
</div>

<div id="org89e1739" class="outline-2">
<h2 id="org89e1739"><span class="section-number-2">2</span> 内置核心数据类型</h2>
<div class="outline-text-2" id="text-2">
<p>
尽量不要自定义类型内置类型效率更高
</p>
</div>
</div>

<div id="orgd19f41d" class="outline-2">
<h2 id="orgd19f41d"><span class="section-number-2">3</span> 数值</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="orgacb885a" class="outline-3">
<h3 id="orgacb885a"><span class="section-number-3">3.1</span> int</h3>
<div class="outline-text-3" id="text-3-1">
<p>
没有长度限制,可以处理非常大的数字
0b1 0o7 0x7ff
</p>
</div>
</div>
<div id="orgb936101" class="outline-3">
<h3 id="orgb936101"><span class="section-number-3">3.2</span> float</h3>
<div class="outline-text-3" id="text-3-2">
<p>
3.14e5
</p>
</div>
</div>
<div id="org3d22c53" class="outline-3">
<h3 id="org3d22c53"><span class="section-number-3">3.3</span> 运算符</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-python">  ** &#35745;&#31639;&#27425;&#26041;
  // &#25972;&#38500;

<span style="color: #6c71c4;">21</span> // <span style="color: #6c71c4;">7</span>    <span style="color: #6c71c4;">3</span>
<span style="color: #6c71c4;">21</span> / <span style="color: #6c71c4;">7</span>     <span style="color: #6c71c4;">3</span>.<span style="color: #6c71c4;">0</span>
</pre>
</div>
</div>
</div>
<div id="org796f2b8" class="outline-3">
<h3 id="org796f2b8"><span class="section-number-3">3.4</span> 常用函数</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">10</span> + <span style="color: #839496; font-weight: bold;">int</span>(<span style="color: #2aa198;">"30"</span>)
<span style="color: #6c71c4;">10</span> + <span style="color: #839496; font-weight: bold;">int</span>(<span style="color: #2aa198;">"1101"</span>, <span style="color: #6c71c4;">2</span>) //&#36716;&#25442;&#25104;2&#36827;&#21046;
<span style="color: #839496; font-weight: bold;">float</span>(<span style="color: #2aa198;">"3.13"</span>) * <span style="color: #6c71c4;">2</span>
<span style="color: #839496; font-weight: bold;">bin</span>(<span style="color: #6c71c4;">10</span>) //<span style="color: #6c71c4;">0b11</span>  &#36716;&#25442;&#25104;2&#36827;&#21046;
<span style="color: #839496; font-weight: bold;">hex</span>(<span style="color: #6c71c4;">10</span>)
<span style="color: #839496; font-weight: bold;">oct</span>(<span style="color: #6c71c4;">10</span>)
</pre>
</div>
</div>
</div>

<div id="org30fad90" class="outline-3">
<h3 id="org30fad90"><span class="section-number-3">3.5</span> 工具模块</h3>
<div class="outline-text-3" id="text-3-5">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">import</span> math

<span style="color: #268bd2;">x</span> = <span style="color: #6c71c4;">22</span> / <span style="color: #6c71c4;">7</span>
math.floor(x)  //&#21521;&#19979;&#21462;&#20540;

math.trunc(<span style="color: #6c71c4;">3</span>.<span style="color: #6c71c4;">14</span>)  //&#21521;0&#21462;&#20540;

math.ceil(<span style="color: #6c71c4;">3</span>.<span style="color: #6c71c4;">14</span>) //&#21521;&#19978;&#21462;&#20540;

<span style="color: #839496; font-weight: bold;">round</span>(<span style="color: #6c71c4;">3</span>.<span style="color: #6c71c4;">14</span>) //&#22235;&#33293;&#20116;&#20837;
</pre>
</div>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">import</span> decimal

<span style="color: #6c71c4;">0</span>.<span style="color: #6c71c4;">1</span> + <span style="color: #6c71c4;">0</span>.<span style="color: #6c71c4;">1</span> + <span style="color: #6c71c4;">0</span>.<span style="color: #6c71c4;">1</span> - <span style="color: #6c71c4;">0</span>.<span style="color: #6c71c4;">3</span>  //&#32467;&#26524;&#19981;&#23545;
decimal.Decimal(<span style="color: #6c71c4;">0</span>.<span style="color: #6c71c4;">1</span>) + decimal.Decimal(<span style="color: #6c71c4;">0</span>.<span style="color: #6c71c4;">1</span>) + decimal.Decimal(<span style="color: #6c71c4;">0</span>.<span style="color: #6c71c4;">1</span>) - decimal.Decimal(<span style="color: #6c71c4;">0</span>.<span style="color: #6c71c4;">3</span>) // error
decimal.Decimal(<span style="color: #2aa198;">'0.1'</span>) + decimal.Decimal(<span style="color: #2aa198;">'0.1'</span>) + decimal.Decimal(<span style="color: #2aa198;">'0.1'</span>) - decimal.Decimal(<span style="color: #2aa198;">'0.3'</span>)
</pre>
</div>
</div>
</div>
</div>

<div id="org5140f2b" class="outline-2">
<h2 id="org5140f2b"><span class="section-number-2">4</span> 序列</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="org9cfe43a" class="outline-3">
<h3 id="org9cfe43a"><span class="section-number-3">4.1</span> 可变序列</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="org1abeaaa" class="outline-4">
<h4 id="org1abeaaa"><span class="section-number-4">4.1.1</span> list</h4>
<div class="outline-text-4" id="text-4-1-1">
<ol class="org-ol">
<li>可包含任意对象的有序集合</li>
<li>可变长度,异质,可任意嵌套</li>
<li>支持原位改变</li>
<li>对象引用数组</li>
</ol>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2;">scores</span> = [<span style="color: #6c71c4;">80</span>, <span style="color: #6c71c4;">90</span>, <span style="color: #6c71c4;">90</span>.<span style="color: #6c71c4;">3</span>. <span style="color: #2aa198;">"tom"</span>]

scores[-<span style="color: #6c71c4;">1</span>]

scores[<span style="color: #6c71c4;">0</span>:<span style="color: #6c71c4;">2</span>]

scores.append(<span style="color: #6c71c4;">79</span>)

<span style="color: #268bd2;">x</span> = [<span style="color: #6c71c4;">1</span>, <span style="color: #6c71c4;">2</span>, <span style="color: #6c71c4;">3</span>]

scores.append(x)

<span style="color: #268bd2;">scores</span>[<span style="color: #6c71c4;">0</span>] = <span style="color: #6c71c4;">85</span>.<span style="color: #6c71c4;">2</span>
</pre>
</div>
</div>
</div>

<div id="org965dfcf" class="outline-4">
<h4 id="org965dfcf"><span class="section-number-4">4.1.2</span> 通用操作</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
改变某个元素的值 s[i] = x
改变特定范围内的元素值 s[i:j] = t
按照特定步长值改变 s[i:j:k] = t
删除元素 del s[i]  删除单个,范围,步长
s.remove(x) //只删除第一个匹配的值清空 s.clear()
追加元素  s.append(x)
扩展元素  s.extend(t)
插入元素  s.insert(i, x)
检索并删除特定元素  s.pop() s.pop(i)
反转  s.reverse()
复制内容  s = l[:]  s = l.copy()
排序 s.sort()
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2;">s</span> = <span style="color: #839496; font-weight: bold;">list</span>(<span style="color: #839496; font-weight: bold;">range</span>(<span style="color: #6c71c4;">1</span>, <span style="color: #6c71c4;">11</span>))

<span style="color: #268bd2;">s</span>[<span style="color: #6c71c4;">0</span>] = <span style="color: #6c71c4;">99</span>

 <span style="color: #268bd2;">s</span>[:<span style="color: #6c71c4;">3</span>] = <span style="color: #6c71c4;">100</span> //error

 <span style="color: #268bd2;">s</span>[:<span style="color: #6c71c4;">3</span>] = [<span style="color: #6c71c4;">98</span>, <span style="color: #6c71c4;">99</span>, <span style="color: #6c71c4;">100</span>]

 <span style="color: #268bd2;">s</span>[:<span style="color: #6c71c4;">3</span>] = [<span style="color: #6c71c4;">98</span>, <span style="color: #6c71c4;">99</span>, <span style="color: #6c71c4;">100</span>, <span style="color: #6c71c4;">101</span>, <span style="color: #6c71c4;">102</span>] //&#21487;&#20197;&#25968;&#37327;&#26356;&#22810;

 <span style="color: #268bd2;">s</span>[<span style="color: #6c71c4;">1</span>:<span style="color: #6c71c4;">5</span>] = [<span style="color: #6c71c4;">999</span>] //&#21487;&#20197;&#26356;&#23569;

 <span style="color: #268bd2;">l</span> = <span style="color: #839496; font-weight: bold;">list</span>(<span style="color: #839496; font-weight: bold;">range</span>(<span style="color: #6c71c4;">1</span>, <span style="color: #6c71c4;">11</span>))

 <span style="color: #268bd2;">l</span>[::<span style="color: #6c71c4;">2</span>] = [<span style="color: #6c71c4;">99</span>, <span style="color: #6c71c4;">99</span>, <span style="color: #6c71c4;">99</span>, <span style="color: #6c71c4;">99</span>, <span style="color: #6c71c4;">99</span>] //&#20010;&#25968;&#24517;&#39035;&#30456;&#21516;

 <span style="color: #859900; font-weight: bold;">del</span> l[<span style="color: #6c71c4;">0</span>]

 <span style="color: #859900; font-weight: bold;">del</span> l[:<span style="color: #6c71c4;">3</span>]

 <span style="color: #859900; font-weight: bold;">del</span> l[::<span style="color: #6c71c4;">2</span>]

 <span style="color: #268bd2;">l</span>[:<span style="color: #6c71c4;">3</span>] = [] //&#20063;&#21487;&#20197;&#20570;&#21024;&#38500;

 l.remove(<span style="color: #6c71c4;">2</span>)

 l.extend([<span style="color: #6c71c4;">9</span>, <span style="color: #6c71c4;">10</span>]);

 l.insert(<span style="color: #6c71c4;">3</span>, <span style="color: #6c71c4;">100</span>);

 <span style="color: #268bd2;">l</span>[<span style="color: #6c71c4;">2</span>:<span style="color: #6c71c4;">2</span>] = <span style="color: #6c71c4;">101</span>;

 <span style="color: #268bd2;">s</span> = l; //&#20849;&#20139;&#24341;&#29992;
 <span style="color: #268bd2;">s</span> = l[:];  //&#22797;&#21046;&#20869;&#23481;
 <span style="color: #268bd2;">s</span> = l.copy();

 people.sort(key=<span style="color: #859900; font-weight: bold;">lambda</span> x:x[-<span style="color: #6c71c4;">1</span>])

 score.sort(reverse=<span style="color: #268bd2; font-weight: bold;">True</span>)

 <span style="color: #268bd2;">temp</span> = <span style="color: #839496; font-weight: bold;">sorted</span>(score)

 <span style="color: #839496; font-weight: bold;">sorted</span>(people, key=<span style="color: #859900; font-weight: bold;">lambda</span> n:n[<span style="color: #6c71c4;">1</span>])

</pre>
</div>
</div>
</div>
</div>

<div id="orgc3a119f" class="outline-3">
<h3 id="orgc3a119f"><span class="section-number-3">4.2</span> 不可变序列</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="org68920e3" class="outline-4">
<h4 id="org68920e3"><span class="section-number-4">4.2.1</span> tuple</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
固定长度
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2;">t</span> = ();
<span style="color: #268bd2;">t</span> = (<span style="color: #6c71c4;">1</span>, <span style="color: #6c71c4;">3</span>, <span style="color: #6c71c4;">3</span>)
<span style="color: #268bd2;">t</span> = (<span style="color: #6c71c4;">1</span>, <span style="color: #6c71c4;">2</span>, <span style="color: #6c71c4;">3</span>, (<span style="color: #6c71c4;">99</span>, <span style="color: #6c71c4;">100</span>), <span style="color: #2aa198;">"tom"</span>)

<span style="color: #268bd2;">t</span> = (<span style="color: #2aa198;">'jerry'</span>) //error &#22768;&#26126;&#20102;&#19968;&#20010;str
<span style="color: #268bd2;">t</span> = (<span style="color: #2aa198;">'jerry'</span>,) //&#21482;&#26377;&#19968;&#20010;&#20803;&#32032;,&#38656;&#35201;&#22312;&#22768;&#26126;&#30340;&#21518;&#38754;&#21152;&#19978;&#19968;&#20010;,

<span style="color: #268bd2;">t2</span> = <span style="color: #6c71c4;">1</span>, <span style="color: #6c71c4;">2</span>, <span style="color: #6c71c4;">3</span> //&#20063;&#21487;&#20197;&#22768;&#26126;&#19968;&#20010;&#20803;&#32452;
<span style="color: #268bd2;">t2</span> = <span style="color: #2aa198;">'jerry'</span>, //&#21487;&#20197;&#19981;&#21152;&#25324;&#21495;

<span style="color: #268bd2;">t3</span> = <span style="color: #839496; font-weight: bold;">tuple</span>(<span style="color: #839496; font-weight: bold;">range</span>(<span style="color: #6c71c4;">1</span>, <span style="color: #6c71c4;">6</span>))

t3[<span style="color: #6c71c4;">0</span>:<span style="color: #6c71c4;">2</span>]

<span style="color: #268bd2;">t</span> = t + t1

<span style="color: #268bd2;">a</span>, <span style="color: #268bd2;">b</span> = <span style="color: #6c71c4;">5</span>, <span style="color: #6c71c4;">10</span>

<span style="color: #268bd2;">a</span>, <span style="color: #268bd2;">b</span> = b, a //&#20132;&#25442;
</pre>
</div>
</div>
</div>
<div id="org6d0d986" class="outline-4">
<h4 id="org6d0d986"><span class="section-number-4">4.2.2</span> range</h4>
<div class="outline-text-4" id="text-4-2-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #839496; font-weight: bold;">range</span>(<span style="color: #6c71c4;">4</span>)
<span style="color: #839496; font-weight: bold;">range</span>(<span style="color: #6c71c4;">1</span>,<span style="color: #6c71c4;">3</span>)
<span style="color: #839496; font-weight: bold;">range</span>(<span style="color: #6c71c4;">1</span>, <span style="color: #6c71c4;">11</span>, <span style="color: #6c71c4;">2</span>)

  <span style="color: #859900; font-weight: bold;">for</span> i <span style="color: #859900; font-weight: bold;">in</span> <span style="color: #839496; font-weight: bold;">range</span>(<span style="color: #6c71c4;">4</span>):
      <span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #2aa198;">"hello"</span> + <span style="color: #839496; font-weight: bold;">str</span>(i))
</pre>
</div>
</div>
</div>

<div id="orgb34b97d" class="outline-4">
<h4 id="orgb34b97d"><span class="section-number-4">4.2.3</span> 字符串 str</h4>
<div class="outline-text-4" id="text-4-2-3">
<ol class="org-ol">
<li>特性</li>
</ol>
<p>
可用单引号或双引号,无区别三引号 多行字符串
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2;">path</span> = r<span style="color: #2aa198;">"C:\abc\tag"</span> //&#19981;&#35299;&#26512;&#36716;&#20041;&#23383;&#31526;
<span style="color: #268bd2;">path</span> = <span style="color: #2aa198;">"C:\\abc\\tag"</span>
<span style="color: #268bd2;">path</span> = b<span style="color: #2aa198;">'abc'</span> //&#20197;&#23383;&#33410;&#30340;&#26041;&#24335;&#22768;&#26126;&#23383;&#31526;&#20018;

<span style="color: #268bd2;">s</span> = <span style="color: #2aa198;">'&#20248;&#21697;&#35838;&#22530;'</span>.encode()
s.decode()

<span style="color: #268bd2;">s</span> = <span style="color: #2aa198;">'abcd'</span>

<span style="color: #2aa198;">'c'</span> <span style="color: #859900; font-weight: bold;">in</span> s


</pre>
</div>
<ol class="org-ol">
<li>常用操作</li>
</ol>
<p>
不可原位改变,只能用方法返回给一个新的字符串
</p>

<p>
str.replace(old, new, n)
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2;">s</span> = <span style="color: #2aa198;">'aaaaa'</span>

s.replace(<span style="color: #2aa198;">'a'</span>, <span style="color: #2aa198;">'b'</span>) //bbbbb

s.replace(<span style="color: #2aa198;">'a'</span>, <span style="color: #2aa198;">'b'</span>, <span style="color: #6c71c4;">2</span>) //aabbb

s.captalize()

s.upper()

s.lower()

s.startswith()

s.endswith()

<span style="color: #268bd2;">s</span> = <span style="color: #2aa198;">'www.abc.com'</span>

<span style="color: #268bd2;">l</span> =   s.split(<span style="color: #2aa198;">'.'</span>)

<span style="color: #2aa198;">':'</span>.join(l)

<span style="color: #268bd2;">name</span> = <span style="color: #2aa198;">'tom'</span>
<span style="color: #268bd2;">age</span> = <span style="color: #6c71c4;">20</span>
<span style="color: #268bd2;">job</span> = <span style="color: #2aa198;">'Dev'</span>

<span style="color: #2aa198;">'&#22995;&#21517;:{0} &#24180;&#40836;:[1] &#24037;&#20316;:{2}'</span>.<span style="color: #839496; font-weight: bold;">format</span>(name, age, job)

<span style="color: #2aa198;">'&#22995;&#21517;:{0} &#24180;&#40836;:[1] &#24037;&#20316;:{2} &#37096;&#38376;:{department}'</span>.<span style="color: #839496; font-weight: bold;">format</span>(name, age, job, department=<span style="color: #2aa198;">'tech'</span>)

<span style="color: #2aa198;">'[0] = {1}'</span>.<span style="color: #839496; font-weight: bold;">format</span>(<span style="color: #2aa198;">'abc'</span>, <span style="color: #6c71c4;">124</span>.<span style="color: #6c71c4;">344</span>)

<span style="color: #2aa198;">'{0:10} = {1:12}'</span>.<span style="color: #839496; font-weight: bold;">format</span>(<span style="color: #2aa198;">'abc'</span>, <span style="color: #6c71c4;">123</span>.<span style="color: #6c71c4;">344</span>)  //&#21344;&#20301;&#23485;&#24230;

<span style="color: #2aa198;">'{0:&lt;10} = {1:&gt;12}'</span>.<span style="color: #839496; font-weight: bold;">format</span>(<span style="color: #2aa198;">'abc'</span>, <span style="color: #6c71c4;">123</span>.<span style="color: #6c71c4;">344</span>) //&#24038;&#23545;&#40784; &#21491;&#23545;&#40784;

<span style="color: #268bd2;">pi</span> = <span style="color: #6c71c4;">3</span>.<span style="color: #6c71c4;">14159</span>
<span style="color: #2aa198;">'{:f} {:.2f} {:06.2f}'</span>.<span style="color: #839496; font-weight: bold;">format</span>(pi, pi,pi) //&#28014;&#28857;&#25968;&#26684;&#24335;

<span style="color: #268bd2;">n</span> = <span style="color: #6c71c4;">230</span>
<span style="color: #2aa198;">'{:X} {:o} {:b}'</span>.<span style="color: #839496; font-weight: bold;">format</span>(n, n, n)


</pre>
</div>
</div>
</div>
</div>



<div id="org9af82cc" class="outline-3">
<h3 id="org9af82cc"><span class="section-number-3">4.3</span> 通用操作</h3>
<div class="outline-text-3" id="text-4-3">
<p>
判断元素时否在序列之内 x in s  x not in s
连接序列  x + y
重复序列元素  x * n
下标取值 s[i]
访问指定索引范围s[m:n] 前开后闭 可以用负数指定步长 s[i:j:n]
获取序列长度 len(s)
min(s) max(s) sum(s) count(s)
检索元素第一次出现位置的下标 s.index(x)
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2;">x</span> = [<span style="color: #6c71c4;">1</span>, <span style="color: #6c71c4;">2</span>, <span style="color: #6c71c4;">3</span>]

<span style="color: #268bd2;">name</span> = <span style="color: #839496; font-weight: bold;">list</span>(<span style="color: #2aa198;">'abcd'</span>)

<span style="color: #839496; font-weight: bold;">range</span>(<span style="color: #6c71c4;">5</span>)

<span style="color: #839496; font-weight: bold;">list</span>(<span style="color: #839496; font-weight: bold;">range</span>(<span style="color: #6c71c4;">5</span>))  // <span style="color: #6c71c4;">0</span>, <span style="color: #6c71c4;">1</span>, <span style="color: #6c71c4;">2</span>, <span style="color: #6c71c4;">3</span>, <span style="color: #6c71c4;">4</span>

<span style="color: #268bd2;">scores</span> = [<span style="color: #6c71c4;">80</span>, <span style="color: #6c71c4;">90</span>, <span style="color: #6c71c4;">90</span>.<span style="color: #6c71c4;">3</span>]

<span style="color: #6c71c4;">88</span> <span style="color: #859900; font-weight: bold;">in</span> scores

<span style="color: #6c71c4;">101</span> <span style="color: #859900; font-weight: bold;">not</span> <span style="color: #859900; font-weight: bold;">in</span> scores

x + scores //&#36830;&#25509;&#24207;&#21015;

[<span style="color: #6c71c4;">3</span>] * <span style="color: #6c71c4;">4</span> // [<span style="color: #6c71c4;">3</span>, <span style="color: #6c71c4;">3</span>, <span style="color: #6c71c4;">3</span>, <span style="color: #6c71c4;">3</span>]

score[-<span style="color: #6c71c4;">1</span>]
score[-<span style="color: #6c71c4;">2</span>]

x[<span style="color: #6c71c4;">0</span>:<span style="color: #6c71c4;">2</span>] // [<span style="color: #6c71c4;">1</span>, <span style="color: #6c71c4;">2</span>]

x[:<span style="color: #6c71c4;">2</span>] // [<span style="color: #6c71c4;">1</span>, <span style="color: #6c71c4;">2</span>]

x[<span style="color: #6c71c4;">1</span>:] // [<span style="color: #6c71c4;">2</span>, <span style="color: #6c71c4;">3</span>]

x{:}  //<span style="color: #839496; font-weight: bold;">all</span>

x[::<span style="color: #6c71c4;">2</span>] // [<span style="color: #6c71c4;">1</span>, <span style="color: #6c71c4;">3</span>]

<span style="color: #839496; font-weight: bold;">len</span>(x)

<span style="color: #839496; font-weight: bold;">min</span>(x)

x.index(<span style="color: #6c71c4;">2</span>)

<span style="color: #268bd2;">l</span> = [<span style="color: #6c71c4;">1</span>,<span style="color: #6c71c4;">2</span>,<span style="color: #6c71c4;">2</span>,<span style="color: #6c71c4;">2</span>,<span style="color: #6c71c4;">3</span>]

l.count(<span style="color: #6c71c4;">2</span>) // <span style="color: #6c71c4;">3</span>
</pre>
</div>
</div>
</div>
</div>

<div id="orgbbe8042" class="outline-2">
<h2 id="orgbbe8042"><span class="section-number-2">5</span> 集合</h2>
</div>
<div id="orgd225ee1" class="outline-2">
<h2 id="orgd225ee1"><span class="section-number-2">6</span> 映射</h2>
</div>
<div id="org51f912d" class="outline-2">
<h2 id="org51f912d"><span class="section-number-2">7</span> 程序单元类型</h2>
</div>
<div id="orgc3a5844" class="outline-2">
<h2 id="orgc3a5844"><span class="section-number-2">8</span> 其他</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #839496; font-weight: bold;">type</span>(<span style="color: #6c71c4;">8</span>)

x <span style="color: #859900; font-weight: bold;">is</span> <span style="color: #268bd2; font-weight: bold;">None</span>
</pre>
</div>
</div>
<div id="orgf195ba9" class="outline-3">
<h3 id="orgf195ba9"><span class="section-number-3">8.1</span> 类型对象</h3>
<div class="outline-text-3" id="text-8-1">
<p>
type(obj)
</p>
</div>
</div>

<div id="org2972954" class="outline-3">
<h3 id="org2972954"><span class="section-number-3">8.2</span> 空对象</h3>
<div class="outline-text-3" id="text-8-2">
<p>
None
</p>
</div>
</div>
<div id="orgfb86fcf" class="outline-3">
<h3 id="orgfb86fcf"><span class="section-number-3">8.3</span> 布尔</h3>
<div class="outline-text-3" id="text-8-3">
<p>
本质上True 对应int 1,False 对应int 0, 但仍然可以转换
</p>

<p>
真值测试: 0, 0.0 None,空对象,空字符串,空映射等转换成False,其他都是True
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #839496; font-weight: bold;">bool</span>(<span style="color: #6c71c4;">3</span>)  <span style="color: #268bd2; font-weight: bold;">True</span>

<span style="color: #839496; font-weight: bold;">bool</span>(-<span style="color: #6c71c4;">3</span>) <span style="color: #268bd2; font-weight: bold;">True</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-05-17 Thu 00:00</p>
<p class="author">Author: 孙士杰</p>
<p class="date">Created: 2018-05-18 Fri 09:27</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
